/** A pair of a question and an answer. */
export type QnaPair = {
    /** @readonly */
    readonly question: string;

    /** @readonly */
    readonly answer: string;
}

/** QnA pairs for the `Content` component of the About page. */
export const qnaPairs: QnaPair[] = [
    {
        question: 'מהי מטרת הפרויקט?',
        answer: 'מטרת הפרויקט היא לפשט את תהליך חיפוש נכסי נדל"ן למכירה או להשכרה מאתר יד2.'
    },
    {
        question: 'מי עומד מאחורי הפרויקט?',
        answer: 'הפרויקט נבנה ועוצב על ידי מאור בצלאל למטרות למידה והדגמת ידע מעשי.'
    },
    {
        question: 'איך זה עובד?',
        answer: "הסוכן מבקש מהמשתמש להגדיר פרמטרים לחיפוש סוג מסוים של נכס כגון: מספר חדרים, מחיר, וכו'. כאשר נבחר סוג נכס לחיפוש, מתבצע מאחורי הקלעים תהליך של Web Scraping באתר יד2 כדי}להשיג את המידע המבוקש, ולאחר עיבדו המידע מוחזר למשתמש ומוצג עבורו בצורה נוחה וידידותית. למשתמשים יש גם אפשרות לנווט לעמוד המידע הספציפי של כל נכס באתר יד2 עצמו. המידע מתעדכן בזמן אמת ללא צורך בריענון הדפדפן, תכונה שאינה קיימת כלל באתר יד2."
    }
];